select "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_СЕССИЯ"."ЧЛВК_ИД"
FROM "Н_ЛЮДИ" left join "Н_СЕССИЯ"
    on "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
        where "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Ёлкин' and "Н_СЕССИЯ"."ЧЛВК_ИД" > 105948;


select "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ИД"
FROM "Н_ЛЮДИ"
    right join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    right join "Н_СЕССИЯ" on  "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
 where "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Афанасьев'
           and "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" > 142390
           and "Н_СЕССИЯ"."УЧГОД" < '2003/2004';



select "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ", "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_ЛЮДИ" inner join "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
where "Н_УЧЕНИКИ"."ГРУППА" = '3102'
  and "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" < '1998-09-06 00:00:00.000000';



SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД", count("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА")
FROM "Н_ГРУППЫ_ПЛАНОВ" JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
    JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
HAVING count("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА") > 2;


--
SELECT "Н_УЧЕНИКИ"."ГРУППА", avg(age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) AS "Средний возраст"
FROM "Н_УЧЕНИКИ" JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING max(age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) = (
    SELECT max(age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))
    FROM "Н_УЧЕНИКИ" JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3100'
);


SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ВЕДОМОСТИ"."НОМЕР_ДОКУМЕНТА"
FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
inner join "Н_ПЛАНЫ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
inner join "Н_УЧЕНИКИ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
inner join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
inner join "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
where ("ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'заочная' AND "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл' AND "Н_ВЕДОМОСТИ"."КОГДА_ИЗМЕНИЛ"::date = '2005-09-01'
           );



SELECT * from (SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД", avg("Н_ВЕДОМОСТИ"."ОЦЕНКА"::integer) as AVG_MARK FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ИД"
where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9\.]+$' group by "Н_УЧЕНИКИ"."ЧЛВК_ИД") as AVGS_MARKS
where AVGS_MARKS.AVG_MARK = 5;

SELECT * from (SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД", avg("Н_ВЕДОМОСТИ"."ОЦЕНКА"::integer) as AVG_MARK FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ИД"
where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9\.]+$' group by "Н_УЧЕНИКИ"."ЧЛВК_ИД") as AVGS_MARKS
where AVGS_MARKS.AVG_MARK = 5;

SELECT * from (SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", avg("Н_ВЕДОМОСТИ"."ОЦЕНКА"::integer) as AVG_MARK FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ИД"
               where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9\.]+$' group by "Н_УЧЕНИКИ"."ЧЛВК_ИД","Н_ЛЮДИ"."ФАМИЛИЯ") as AVGS_MARKS
where AVGS_MARKS.AVG_MARK = 5;







